"""
-----------------------------------------------------------------------------------------------
Título: PATRONES DE ASTERISCOS

Fecha: 24/08/2023

Autor: Gianfranco Mazzei

Descripción: Escribir dos funciones separadas para imprimir por pantalla los siguientes patrones
de asteriscos, donde la cantidad de filas se recibe como parámetro.

-----------------------------------------------------------------------------------------------
"""

#----------------------------------------------------------------------------------------------
# MÓDULOS
#----------------------------------------------------------------------------------------------
...


#----------------------------------------------------------------------------------------------
# FUNCIONES
#----------------------------------------------------------------------------------------------

def primerPatronDeAsteriscos(num1):
    for i in range(num1):
        print("**********")

def segundoPatronDeAsteriscos(num2):
    for i in range(1,num2+1):
        multiplicar = "**" * i
        print(multiplicar)

#----------------------------------------------------------------------------------------------
# CUERPO PRINCIPAL
#----------------------------------------------------------------------------------------------
#-------------------------------------------------
# Inicialización de variables y entrada de datos
#-------------------------------------------------



#-------------------------------------------------
# Procesos
#-------------------------------------------------
filas = int(input("Introducir la cantidad de filas: "))
print("----------")
primerPatronDeAsteriscos(filas)
print("----------")
segundoPatronDeAsteriscos(filas)
print("----------")

#-------------------------------------------------
# Resultados
#-------------------------------------------------
...

